# Выведите первый и последний элемент списка.

lst = [1, 2, 3, 4, 5, 6, 7]
print(lst[0], lst[-1])
