# Напишите код, который переводит целое число в строку,
# при том что его можно применить в любой системе счисления.

number = 123
string = str(number)
print(string)
print(type(string))
